/*
某企业发放的奖金根据利润提成。
利润I低于或等于100000时，奖金可提10%；
利润高于100000元，低于200000元（100000<I<=200000）时，
低于100000元的部分仍按10%提成，
高于100000元的部分提成比例为7.5%；200000<I<=400000时，
低于200000元的部分仍按上述方法提成（下同），
高于200000元的部分按5%提成；400000<I<=600000元时，
高于400000元的部分按3%提成；600000<I<=1000000时，
高于600000元的部分按1.5%提成；I>1000000元时，
超过1000000元的部分按1%提成。
从键盘输出当月利润I，求应发奖金数，奖金精确到分。
要求用if语句实现。
*/
#include <stdio.h>

int main(int argc, char const *argv[])
{
    double i, g;
    scanf("%lf", &i);
    if (i <= 100000)
        g = i * 0.1;
    else if (i <= 200000)
        g = 100000 * 0.1 + (i - 100000) * 0.075;
    else if (i <= 400000)
        g = 100000 * 0.1 + 100000 * 0.075 + (i - 200000) * 0.05;
    else if (i <= 600000)
        g = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (i - 400000) * 0.03;
    else if (i <= 1000000)
        g = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (i - 600000) * 0.015;
    else if (i > 1000000)
        g = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (i - 1000000) * 0.01;

    printf("%.2f\n", g);

    return 0;
}